Repository: Hadirback/MyProject
Catalog: MobileApp/Slotlogic.MobileApp/Slotlogic.MobileApp/Localization/Resources.*.resx
Languages: ru

# ButtonMainConnect
source: Log in
ru: Войти

# EntryMainCardNumber
source: № card
ru: № карты

# EntryMainClubId
source: ID club
ru: ID клуба

# EntryMainPassword
source: Password
ru: Пароль

# LabelCommonFrom
source: from
ru: с

# LabelCommonTo
source: to
ru: по

# LabelDrawBonusesForToday
source: Bonuses for today:
ru: Бонусов за сегодня:

# LabelDrawBonusesTill
source: Bonuses till
ru: Бонусов до

# LabelDrawCoupons
source: Coupons:
ru: Купонов:

# LabelDrawFinal
source: Date of draw:
ru: Дата акции:

# LabelDrawPeriod
source: Bonus period:
ru: Период начисления бонусов:

# LabelPlayerInfoDetailCardNumber
source: Card number:
ru: Номер карты:

# LabelPlayerInfoDetailCashback
source: Cashback:
ru: Кэшбэк:

# LabelPlayerInfoDetailHello
source: Hello,
ru: Здравствуйте,

# LabelPlayerInfoDetailPts
source: PTS:
ru: ПТС:

# LabelPlayerInfoDetailStatus
source: Status:
ru: Статус:

# LabelSettingsAboutApp
source: About application
ru: О приложении

# LabelSettingsAboutAppInfo
source: This application is an integral part of the Slotlogic casino management system. The system was created in 2009 and is a universal system serving both casinos and slot machine halls. In 2016, the GLI certificate was obtained, which speaks in favor of high reliability of the system.
ru: Это приложение является неотъемлемой частью системы управления казино Slotlogic. Система была создана в 2009 году и является универсальной системой, обслуживающей как казино, так и залы игровых автоматов. В 2016 году был получен сертификат GLI, что говорит о высокой надежности системы.

# LabelSettingsAppLanguage
source: Application language:
ru: Язык приложения:

# LabelSettingsConfig
source: Settings
ru: Настройки

# LabelSettingsContacts
source: Contacts
ru: Контакты

# LabelSettingsContactsInfo
source: Manufacturer: OOO Technoconsult Tel.: +7495 150-57-69 E-mail: v@slotlogic.eu Site: https://slotlogic.eu/
ru: ИП: OOO Техноконсалт Тел.: +7495 150-57-69 Е-майл: v@slotlogic.eu Сайт: https://slotlogic.eu/

# MenuItemAboutClub
source: About Club
ru: О клубе

# MenuItemDraws
source: Draws
ru: Акции

# MenuItemExit
source: Exit
ru: Выход

# MenuItemProfile
source: Profile
ru: Профиль

# PickerLanguageEnglish
source: English
ru: Английский

# PickerLanguageRussian
source: Russian
ru: Русский

# PickerSettingsTitle
source: Choose language:
ru: Выберете язык:

# SettingsTemplateTitle
source: Settings
ru: Настройки

# ToolbarAboutClub
source: About Club
ru: О клубе

# ToolbarDraws
source: Draws
ru: Акции

# ToolbarSettingsBackButton
source: Back
ru: Назад

# ToolbarTitle
source: Profile
ru: Профиль

# TrCodeErrorUser1001
source: Card is not registered in the system. (error code: 1001)
ru: Карта не зарегистрирована в системе. (Код ошибки: 1001)

# TrCodeErrorUser1002
source: Card is blocked. (error code: 1002)
ru: Карта заблокирована. (Код ошибки: 1002)

# TrCodeErrorUser1003
source: Card is replaced. (error code: 1003)
ru: Карта заменена. (Код ошибки: 1003)

# TrCodeErrorUser1004
source: Card series is blocked. (error code: 1004)
ru: Серия карт заблокирована. (Код ошибки: 1004)

# TrCodeErrorUser1005
source: Card password is incorrect. (error code: 1005)
ru: Пароль карты неверен. (Код ошибки: 1005)

# TrCodeErrorUser1006
source: Card is expired. (error code: 1006)
ru: Срок действия карты истек. (Код ошибки: 1006)

# TrCodeErrorUser1007
source: Incorrect club ID. (error code: 1007)
ru: Неправильно введен ID клуба. (Код ошибки: 1007)

# TrMainPageEnterCardNumber
source: Enter card number!
ru: Введите номер карты!

# TrMainPageEnterCardValid
source: Invalid card number format. Enter in the format XX-XX-000000.
ru: Неверный формат номера карты. Введите в формате XX-XX-000000

# TrMainPageEnterClubID
source: Enter Club ID!
ru: Введите ID Клуба!

# TrMainPageEnterPassword
source: Enter password!
ru: Введите пароль!

# TrMainPageError
source: An error occurred while retrieving data. Contact SlotLogic support.
ru: Произошла ошибка при получении данных. Обратитесь в службу поддержки SlotLogic.

# TrMainPageErrorServer
source: The server is not responding! Contact SlotLogic support.
ru: Сервер не отвечает! Обратитесь в службу поддержки SlotLogic.

# TrTextError
source: Error!
ru: Ошибка!

# TrTextNoInternet
source: No Internet, please reconnect.
ru: Нет интернета, пожалуйста, переподключитесь.

# TrTextOK
source: Ok
ru: Окей
